### 2.5 데이터프레임 데이터 조작

In [1]:
import numpy as np
import pandas as pd

- 데이터 갯수 세기:count()

In [2]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [3]:
df.count()      # 열 별로 NaN이 아닌 값의 갯수 세기

0    4
1    4
2    4
3    3
dtype: int64

In [4]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.tail(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

![Alt text](image-3.png)

In [5]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 카테고리값 세기: value_counts()

In [8]:
titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [9]:
titanic.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

- 정렬: sort_values(),sort_index()

In [10]:
np.random.seed(2023)
df = pd.DataFrame(np.random.randint(40, 101, size=(4, 5)),
                  index=list('abcd'), columns=list('VWXYZ'))
df

    v   w   x   y   z
a  63  65  46  95  73
b  68  43  92  92  62
c  77  72  62  57  87
d  93  87  53  79  45

In [15]:
# W 칼럼 오름차순 기준
df.sort_values(by='w')

    v   w   x   y   z
b  68  43  92  92  62
a  63  65  46  95  73
c  77  72  62  57  87
d  93  87  53  79  45